gambling_keywords = {
    "카지노": 10,
    "도박": 10,
    "토토": 15,
    "배팅": 15,
    "첫충": 30,
    "가입머니": 30,
    "환전": 25,
    "신규가입": 15,
    "지급": 10,
    "접속": 10
}

loan_keywords = {
    "대출": 10,
    "무직자": 20,
    "즉시 승인": 30,
    "당일 대출": 30,
    "신용불량자": 25
}

contact_keywords = [
    "카톡",
    "카카오톡",
    "텔레그램",
    "telegram",
    "오픈채팅",
    "문의주세요",
    "문의 바랍니다"
]

homoglyph_map = {
    # 숫자 → 비슷하게 보이는 문자
    "0": "o",
    "1": "l",
    "3": "e",
    "5": "s",

    # 키릴 문자 → 비슷한 영문자
    "а": "a",
    "е": "e",
    "о": "o",
    "р": "p",
    "с": "c",
    "х": "x"
}

homoglyph_map.update({
    "己": "도",
    "卜": "ㅏ",
})